Vulintus/Vulintus_Board_Definitions/hardware/samd/0.1.0/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA


menu.pcb_ver=Circuit Board Version


########################################################################################################################
# Vulintus HabiTrak
# -----------------

vulintus_habitrak.name=Vulintus HabiTrak

# VID/PID for Bootloader, Arduino & CircuitPython
# Microchip's VID (https://www.microchip.com/usblicensing/)
# Sublicense Request 4325, submitted by Drew on 2/2/2022
vulintus_habitrak.vid.0=0x04D8
vulintus_habitrak.pid.0=0xE6AC
vulintus_habitrak.build.vid=0x04D8
vulintus_habitrak.build.pid=0xE6AC

# Upload
# MOVED TO MENU: vulintus_habitrak.upload.maximum_size=520192
vulintus_habitrak.upload.native_usb=true
vulintus_habitrak.upload.offset=0x4000
vulintus_habitrak.upload.protocol=sam-ba
vulintus_habitrak.upload.tool=bossac18
vulintus_habitrak.upload.use_1200bps_touch=true
vulintus_habitrak.upload.wait_for_upload_port=true

# Build
vulintus_habitrak.build.board=HABITRAK
vulintus_habitrak.build.cache_flags=-DENABLE_CACHE
vulintus_habitrak.build.core=arduino
# MOVED TO MENU: vulintus_habitrak.build.extra_flags=-D__SAMD51__ -D__SAMD51P19A__ -DVULINTUS_HABITRAK {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
vulintus_habitrak.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
vulintus_habitrak.build.flags.optimize=-Os
vulintus_habitrak.build.f_cpu=120000000L
vulintus_habitrak.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
vulintus_habitrak.build.mcu=cortex-m4
# MOVED TO MENU: vulintus_habitrak.build.openocdscript=openocd_scripts/habitrak_v1_0.cfg
# MOVED TO MENU: vulintus_habitrak.build.usb_product="HabiTrak V1.0"
vulintus_habitrak.build.usb_manufacturer="Vulintus"
# MOVED TO MENU: vulintus_habitrak.build.variant=habitrak_v1_0
vulintus_habitrak.build.variant_system_lib=

# Bootloader
# MOVED TO MENU: vulintus_habitrak.bootloader.file=samd51x19a/bootloader_samd51x19a.bin
vulintus_habitrak.bootloader.tool=openocd

# Compiler
vulintus_habitrak.compiler.arm.cmsis.ldflags="-L{runtime.tools.CMSIS-5.4.0.path}/CMSIS/Lib/GCC/" "-L{build.variant.path}" -larm_cortexM4lf_math -mfloat-abi=hard -mfpu=fpv4-sp-d16

# Menu
vulintus_habitrak.menu.pcb_ver.v1_0=HabiTrak V1.0
vulintus_habitrak.menu.pcb_ver.v1_0.upload.maximum_size=520192
vulintus_habitrak.menu.pcb_ver.v1_0.build.extra_flags=-D__SAMD51__ -D__SAMD51P19A__ -DVULINTUS_HABITRAK {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
vulintus_habitrak.menu.pcb_ver.v1_0.build.openocdscript=openocd_scripts/habitrak_v1_0.cfg
vulintus_habitrak.menu.pcb_ver.v1_0.build.usb_product="HabiTrak V1.0"
vulintus_habitrak.menu.pcb_ver.v1_0.build.variant=habitrak_v1_0
vulintus_habitrak.menu.pcb_ver.v1_0.bootloader.file=samd51x19a/bootloader_samd51x19a.bin

vulintus_habitrak.menu.pcb_ver.v1_1=HabiTrak V1.1
vulintus_habitrak.menu.pcb_ver.v1_1.upload.maximum_size=520192
vulintus_habitrak.menu.pcb_ver.v1_1.build.extra_flags=-D__SAMD51__ -D__SAMD51P19A__ -DVULINTUS_HABITRAK {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
vulintus_habitrak.menu.pcb_ver.v1_1.build.openocdscript=openocd_scripts/habitrak_v1_1.cfg
vulintus_habitrak.menu.pcb_ver.v1_1.build.usb_product="HabiTrak V1.1"
vulintus_habitrak.menu.pcb_ver.v1_1.build.variant=habitrak_v1_1
vulintus_habitrak.menu.pcb_ver.v1_1.bootloader.file=samd51x19a/bootloader_samd51x19a.bin

vulintus_habitrak.menu.pcb_ver.v1_2=HabiTrak V1.2
vulintus_habitrak.menu.pcb_ver.v1_2.upload.maximum_size=520192
vulintus_habitrak.menu.pcb_ver.v1_2.build.extra_flags=-D__SAMD51__ -D__SAMD51P19A__ -DVULINTUS_HABITRAK {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
vulintus_habitrak.menu.pcb_ver.v1_2.build.openocdscript=openocd_scripts/habitrak_v1_2.cfg
vulintus_habitrak.menu.pcb_ver.v1_2.build.usb_product="HabiTrak V1.2"
vulintus_habitrak.menu.pcb_ver.v1_2.build.variant=habitrak_v1_2
vulintus_habitrak.menu.pcb_ver.v1_2.bootloader.file=samd51x19a/bootloader_samd51x19a.bin

vulintus_habitrak.menu.pcb_ver.v1_3=HabiTrak V1.3
vulintus_habitrak.menu.pcb_ver.v1_3.upload.maximum_size=520192
vulintus_habitrak.menu.pcb_ver.v1_3.build.extra_flags=-D__SAMD51__ -D__SAMD51P19A__ -DVULINTUS_HABITRAK {build.usb_flags} -D__FPU_PRESENT -DARM_MATH_CM4 -mfloat-abi=hard -mfpu=fpv4-sp-d16
vulintus_habitrak.menu.pcb_ver.v1_3.build.openocdscript=openocd_scripts/habitrak_v1_3.cfg
vulintus_habitrak.menu.pcb_ver.v1_3.build.usb_product="HabiTrak V1.3"
vulintus_habitrak.menu.pcb_ver.v1_3.build.variant=habitrak_v1_3
vulintus_habitrak.menu.pcb_ver.v1_3.bootloader.file=samd51x19a/bootloader_samd51x19a.bin

# Parameter options formerly set with the menu:
# vulintus_habitrak.build.cache_flags=-DENABLE_CACHE
# vulintus_habitrak.build.cache_flags=
# vulintus_habitrak.build.flags.debug=-g
# vulintus_habitrak.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=50000000
# vulintus_habitrak.build.flags.maxqspi=-DVARIANT_QSPI_BAUD_DEFAULT=({build.f_cpu})
# vulintus_habitrak.build.flags.optimize=-Os
# vulintus_habitrak.build.flags.optimize=-O2
# vulintus_habitrak.build.flags.optimize=-O3
# vulintus_habitrak.build.flags.optimize=-Ofast
# vulintus_habitrak.build.flags.optimize=-Ofast -funroll-loops
# vulintus_habitrak.build.flags.usbstack=-DUSE_TINYUSB
# vulintus_habitrak.build.f_cpu=120000000L
# vulintus_habitrak.build.f_cpu=150000000L
# vulintus_habitrak.build.f_cpu=180000000L
# vulintus_habitrak.build.f_cpu=200000000L


########################################################################################################################
# Vulintus OmniTrak Controller
# ----------------------------

